[Killed] BlockStatement
curso-tdd-js/coffee-machine/src/CoffeeMachine.js:4:29
 import { DrinkPrices, Drinks } from "./Drinks";
 
 export default class CoffeeMachine {
-    constructor(drinkMaker) {
-        this.drinkMaker = drinkMaker;
-    }
+    constructor(drinkMaker) {}
 
     make(drink, sugarCount, moneyInput) { 
killedBy: CoffeeMachine should receive correct command for coffee with 1€
statusReason: TypeError: Cannot read properties of undefined (reading 'execute')

[Killed] BlockStatement
curso-tdd-js/coffee-machine/src/CoffeeMachine.js:8:41
         this.drinkMaker = drinkMaker;
     }
 
-    make(drink, sugarCount, moneyInput) { 
-        this.validateDrink(drink);
-        const moneyDiff = this.checkMoneyDifference(drink, moneyInput);
-        const hasEnoughMoney = moneyDiff >= 0;
-        const command = hasEnoughMoney
-            ? this.buildDrinkCommand(drink, sugarCount)
-            : this.buildMoneyMissingCommand(moneyDiff);
-        this.drinkMaker.execute(command);
-    }
+    make(drink, sugarCount, moneyInput) {}
 
     validateDrink(drink) {
killedBy: CoffeeMachine should receive correct command for coffee with 1€
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "C::"

Number of calls: 0

[Killed] EqualityOperator
curso-tdd-js/coffee-machine/src/CoffeeMachine.js:11:32
     make(drink, sugarCount, moneyInput) { 
         this.validateDrink(drink);
         const moneyDiff = this.checkMoneyDifference(drink, moneyInput);
-        const hasEnoughMoney = moneyDiff >= 0;
+        const hasEnoughMoney = moneyDiff < 0;
         const command = hasEnoughMoney
             ? this.buildDrinkCommand(drink, sugarCount)
killedBy: CoffeeMachine should receive correct command for coffee with 1€
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "C::"
Received: "M:0.4€ missing"

Number of calls: 1

[Killed] EqualityOperator
curso-tdd-js/coffee-machine/src/CoffeeMachine.js:11:32
     make(drink, sugarCount, moneyInput) { 
         this.validateDrink(drink);
         const moneyDiff = this.checkMoneyDifference(drink, moneyInput);
-        const hasEnoughMoney = moneyDiff >= 0;
+        const hasEnoughMoney = moneyDiff > 0;
         const command = hasEnoughMoney
             ? this.buildDrinkCommand(drink, sugarCount)
killedBy: CoffeeMachine should receive correct command for coffee with the exact amount
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "C::"
Received: "M:0.0€ missing"

Number of calls: 1

[Killed] BlockStatement
curso-tdd-js/coffee-machine/src/CoffeeMachine.js:18:26
         this.drinkMaker.execute(command);
     }
 
-    validateDrink(drink) {
-        const drinks = Object.values(Drinks);
-        if (!drinks.includes(drink)) {
-            throw new Error('Invalid drink')
-        }
-    }
+    validateDrink(drink) {}
 
     buildDrinkCommand(drink, sugarCount) {
killedBy: CoffeeMachine should throw error for invalid drink
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "Invalid drink"

Received function did not throw

[Killed] BooleanLiteral
curso-tdd-js/coffee-machine/src/CoffeeMachine.js:20:13
 
     validateDrink(drink) {
         const drinks = Object.values(Drinks);
-        if (!drinks.includes(drink)) {
+        if (drinks.includes(drink)) {
             throw new Error('Invalid drink')
         }
killedBy: CoffeeMachine should receive correct command for coffee with 1€
statusReason: Error: Invalid drink

[Killed] ConditionalExpression
curso-tdd-js/coffee-machine/src/CoffeeMachine.js:20:13
 
     validateDrink(drink) {
         const drinks = Object.values(Drinks);
-        if (!drinks.includes(drink)) {
+        if (false) {
             throw new Error('Invalid drink')
         }
killedBy: CoffeeMachine should throw error for invalid drink
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "Invalid drink"

Received function did not throw

[Killed] BlockStatement
curso-tdd-js/coffee-machine/src/CoffeeMachine.js:25:42
         }
     }
 
-    buildDrinkCommand(drink, sugarCount) {
-        const sugarParams = sugarCount ? `${sugarCount}:0` : ':';
-        if (drink === Drinks.COFFEE) {
-            return `C:${sugarParams}`;
-        }
-        if (drink === Drinks.TEA) {
-            return `T:${sugarParams}`;
-        }
-        return `H:${sugarParams}`;
-    }
+    buildDrinkCommand(drink, sugarCount) {}
 
     buildMessageCommand(message) {
killedBy: CoffeeMachine should receive correct command for coffee with 1€
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "C::"
Received: undefined

Number of calls: 1

[Killed] StringLiteral
curso-tdd-js/coffee-machine/src/CoffeeMachine.js:26:62
     }
 
     buildDrinkCommand(drink, sugarCount) {
-        const sugarParams = sugarCount ? `${sugarCount}:0` : ':';
+        const sugarParams = sugarCount ? `${sugarCount}:0` : "";
         if (drink === Drinks.COFFEE) {
             return `C:${sugarParams}`;
killedBy: CoffeeMachine should receive correct command for coffee with 1€
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "C::"
Received: "C:"

Number of calls: 1

[Killed] ConditionalExpression
curso-tdd-js/coffee-machine/src/CoffeeMachine.js:27:13
 
     buildDrinkCommand(drink, sugarCount) {
         const sugarParams = sugarCount ? `${sugarCount}:0` : ':';
-        if (drink === Drinks.COFFEE) {
+        if (true) {
             return `C:${sugarParams}`;
         }
killedBy: CoffeeMachine should receive correct command for tea with 1€
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "T::"
Received: "C::"

Number of calls: 1

[Killed] ConditionalExpression
curso-tdd-js/coffee-machine/src/CoffeeMachine.js:27:13
 
     buildDrinkCommand(drink, sugarCount) {
         const sugarParams = sugarCount ? `${sugarCount}:0` : ':';
-        if (drink === Drinks.COFFEE) {
+        if (false) {
             return `C:${sugarParams}`;
         }
killedBy: CoffeeMachine should receive correct command for coffee with 1€
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "C::"
Received: "H::"

Number of calls: 1

[Killed] ConditionalExpression
curso-tdd-js/coffee-machine/src/CoffeeMachine.js:30:13
         if (drink === Drinks.COFFEE) {
             return `C:${sugarParams}`;
         }
-        if (drink === Drinks.TEA) {
+        if (false) {
             return `T:${sugarParams}`;
         }
killedBy: CoffeeMachine should receive correct command for tea with 1€
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "T::"
Received: "H::"

Number of calls: 1

[Killed] BlockStatement
curso-tdd-js/coffee-machine/src/CoffeeMachine.js:30:35
         if (drink === Drinks.COFFEE) {
             return `C:${sugarParams}`;
         }
-        if (drink === Drinks.TEA) {
-            return `T:${sugarParams}`;
-        }
+        if (drink === Drinks.TEA) {}
         return `H:${sugarParams}`;
     }
killedBy: CoffeeMachine should receive correct command for tea with 1€
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "T::"
Received: "H::"

Number of calls: 1

[Killed] StringLiteral
curso-tdd-js/coffee-machine/src/CoffeeMachine.js:31:20
             return `C:${sugarParams}`;
         }
         if (drink === Drinks.TEA) {
-            return `T:${sugarParams}`;
+            return ``;
         }
         return `H:${sugarParams}`;
killedBy: CoffeeMachine should receive correct command for tea with 1€
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "T::"
Received: ""

Number of calls: 1

[Killed] BlockStatement
curso-tdd-js/coffee-machine/src/CoffeeMachine.js:36:34
         return `H:${sugarParams}`;
     }
 
-    buildMessageCommand(message) {
-        return `M:${message}`;
-    }
+    buildMessageCommand(message) {}
 
     checkMoneyDifference(drink, moneyInput) {
killedBy: CoffeeMachine should receive message command for coffee without enough money with 0,20€
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "M:0.4€ missing"
Received: undefined

Number of calls: 1

[Killed] BlockStatement
curso-tdd-js/coffee-machine/src/CoffeeMachine.js:40:45
         return `M:${message}`;
     }
 
-    checkMoneyDifference(drink, moneyInput) {
-        return moneyInput - DrinkPrices[drink];
-    }
+    checkMoneyDifference(drink, moneyInput) {}
 
     buildMoneyMissingCommand(moneyDiff) {
killedBy: CoffeeMachine should receive correct command for coffee with 1€
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "C::"
Received: "M:NaN€ missing"

Number of calls: 1

[Killed] ArithmeticOperator
curso-tdd-js/coffee-machine/src/CoffeeMachine.js:41:16
     }
 
     checkMoneyDifference(drink, moneyInput) {
-        return moneyInput - DrinkPrices[drink];
+        return moneyInput + DrinkPrices[drink];
     }
 
killedBy: CoffeeMachine should receive message command for coffee without enough money with 0,20€
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "M:0.4€ missing"
Received: "C::"

Number of calls: 1

[Killed] BlockStatement
curso-tdd-js/coffee-machine/src/CoffeeMachine.js:44:41
         return moneyInput - DrinkPrices[drink];
     }
 
-    buildMoneyMissingCommand(moneyDiff) {
-        return this.buildMessageCommand(
-            `${this.formatMoneyDiff(moneyDiff)}€ missing`
-        );
-    }
+    buildMoneyMissingCommand(moneyDiff) {}
 
     formatMoneyDiff(moneyDiff) {
killedBy: CoffeeMachine should receive message command for coffee without enough money with 0,20€
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "M:0.4€ missing"
Received: undefined

Number of calls: 1

[Killed] BlockStatement
curso-tdd-js/coffee-machine/src/CoffeeMachine.js:50:32
         );
     }
 
-    formatMoneyDiff(moneyDiff) {
-        return Math.abs(moneyDiff).toFixed(1);
-    }
+    formatMoneyDiff(moneyDiff) {}
 
 }
killedBy: CoffeeMachine should receive message command for coffee without enough money with 0,20€
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "M:0.4€ missing"
Received: "M:undefined€ missing"

Number of calls: 1
