[Survived] BlockStatement
curso-tdd-js/coffee-machine/src/DrinkMaker.js:2:22
 export default class DrinkMaker {
-    execute(command) { 
-        console.log(`Making ${command}`);
-    }
+    execute(command) {}
 }

[Survived] StringLiteral
curso-tdd-js/coffee-machine/src/DrinkMaker.js:3:21
 export default class DrinkMaker {
     execute(command) { 
-        console.log(`Making ${command}`);
+        console.log(``);
     }
 }
