[Killed] ObjectLiteral
curso-tdd-js/coffee-machine/src/Drinks.js:6:21
     TEA: 'tea',
     CHOCOLATE: 'chocolate'
 };
-const DrinkPrices = {
-    [Drinks.COFFEE]: 0.6,
-    [Drinks.TEA]: 0.4,
-    [Drinks.CHOCOLATE]: 0.5,
-}
+const DrinkPrices = {}
 export { Drinks, DrinkPrices };
killedBy: CoffeeMachine should receive correct command for coffee with 1€
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "C::"
Received: "M:NaN€ missing"

Number of calls: 1
